Description: Downloads the latest version of Adobe Creative Cloud and makes a pkg. Then, uploads the package to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.goteamgecko.pkg.AdobeCreativeCloudInstaller
MinimumVersion: "2.3"
ParentRecipe: com.github.rtrouton.pkg.AdobeCreativeCloudInstallerUniversal

Input:
  NAME: Creative Cloud
  CATEGORY: App Updates
  PKG_CATEGORY: "%CATEGORY%"
  GROUP_NAME: "Auto-Update - %NAME%"
  GROUP_TEMPLATE: ACC-SmartGroup.xml
  EXTENSION_ATTRIBUTE_NAME: "Auto-Update - %NAME%"
  EXTENSION_ATTRIBUTE_SCRIPT: ACC-ExtensionAttribute-CFBundleShortVersionString.sh
  VERSION_CRITERION: Application Version
  TESTING_GROUP_NAME: 3PPTesting
  POLICY_CATEGORY: App Updates
  POLICY_TEMPLATE: ACC-Policy-install.xml
  POLICY_NAME: "%NAME%"
  POLICY_RUN_COMMAND: 'chown -R "$(stat -f%Su /dev/console):staff" "/Applications/%NAME%.app" && echo "Corrected permissions for %NAME%."'
  SELF_SERVICE_DISPLAY_NAME: "Install %NAME%"
  SELF_SERVICE_DESCRIPTION: "%NAME% is a collection of apps for photography, video, design, web, UX, and social media."
  SELF_SERVICE_ICON: "%NAME%.png"
  INSTALL_BUTTON_TEXT: "Install"
  REINSTALL_BUTTON_TEXT: "Renstall"
  UPDATE_PREDICATE: "pkg_uploaded == False"
  JSS_INVENTORY_NAME: "%NAME%.app"

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: "%CATEGORY%"

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
   pkg_category: "%CATEGORY%"

- Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator
  Arguments:
    version: "%version%"

- Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
  Arguments:
    ea_script_path: "%EXTENSION_ATTRIBUTE_SCRIPT%"
    ea_name: "%EXTENSION_ATTRIBUTE_NAME%"
    replace_ea: true

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_template: "%GROUP_TEMPLATE%"
    computergroup_name: "%GROUP_NAME%-%version%"
    replace_computergroup: false

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_template: "%POLICY_TEMPLATE%"
    policy_name: "%POLICY_NAME%-%version%"
    icon: "%SELF_SERVICE_ICON%"
    replace_policy: false
