<?xml version="1.0" encoding="UTF-8"?>
<policy>
	<general>
		<name>%POLICY_NAME%-%version%</name>
		<enabled>true</enabled>
		<trigger>CHECKIN</trigger>
		<trigger_checkin>true</trigger_checkin>
		<frequency>Once every week</frequency>
		<category>
			<name>%POLICY_CATEGORY%</name>
		</category>
	</general>
	<scope>
		<computer_groups>
			<computer_group>
				<name>%GROUP_NAME%-%version%</name>
			</computer_group>
		</computer_groups>
	</scope>
	<package_configuration>
		<packages>
			<size>0</size>
		</packages>
	</package_configuration>
	<scripts>
      <size>1</size>
      <script>
        <name>Zoom install global</name>
        <priority>After</priority>
        <parameter4/>
        <parameter5/>
        <parameter6/>
        <parameter7/>
        <parameter8/>
        <parameter9/>
        <parameter10/>
        <parameter11/>
      </script>
    </scripts>
	<self_service>
		<use_for_self_service>true</use_for_self_service>
		<install_button_text>%INSTALL_BUTTON_TEXT%</install_button_text>
		<reinstall_button_text>%REINSTALL_BUTTON_TEXT%</reinstall_button_text>
		<self_service_display_name>%SELF_SERVICE_DISPLAY_NAME%</self_service_display_name>
		<self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
	</self_service>
	<maintenance>
		<recon>true</recon>
	</maintenance>
	<files_processes>
		<run_command>%POLICY_RUN_COMMAND%</run_command>
	</files_processes>
	<user_interaction>
		<message_start>Company IT has identified that %NAME% needs a critical update. Please quit %NAME% and click "Submit" to install the latest version.</message_start>
		<allow_users_to_defer>true</allow_users_to_defer>
		<allow_deferral_until_utc/>
		<allow_deferral_minutes>2880</allow_deferral_minutes>
		<message_finish>The update to %NAME% is complete. Please quit and re-open %NAME%.</message_finish>
	</user_interaction>
</policy>
